Autodesk.Revit.DB.Macros.MacroModule.RemoveMacro(Autodesk.Revit.DB.Macros.Macro)
Removes a macro from the module.
macro:
The macro will be removed from this module.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Macros.MacroModule.AddMacro(System.String,System.String,System.String)
Adds a macro to the module.
name:
The macro name.
description:
The description.
code:
The code string, which should be the lines between the main bounding brackets of a method.
Returns:
The new macro.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Macros.MacroModule.Description
The module description.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Macros.MacroModule.MacroLevel
The Macro level.
Since:
2014